import rtde_receive

rtdeReceive = rtde_receive.RTDEReceiveInterface("192.168.123.238")
print(rtdeReceive.getActualTCPPose())

"""
拍照位
pose01:
[-0.0024189629431831472, -0.21949273545323583, 0.7166685528214274, 0.044431838489696326, 3.1324017532872155, 0.0029036163133503963]

放置点
pose02:
[-0.0909975465363621, -0.47821626147997687, 0.6568718816957089, -0.015570748533342487, -3.1371962733963366, 0.007055654303328155]


拍照获得数据比较快，根据拍照数据计算出位姿然后驱使UR动作这一步有点慢，后面可以改成第一拍照然后驱使UR夹爪角度转正，
第二次拍照完成后不用驱使夹爪纠偏计算好目标点位姿就好，之前第三部是完全纠偏之后拍照获取数据记录到log的，也可以去掉，这样整体速度会快不少


注意是在UR tool坐标系下面的偏移:
x:0.0833
y:-0.259
z:0.108

"""
