import rtde_receive

rtdeReceive = rtde_receive.RTDEReceiveInterface("192.168.123.238")
print(rtdeReceive.getActualTCPPose())
"""
拍照位
pose01:
[0.005018593113787098, -0.2193136383002385, 0.7168432472933255, -0.0031934014287014747, 3.1264406974879426, -0.0015255801544713859]

放置点
pose02:
[-0.07836862220347364, -0.4784920171658646, 0.5787243609784314, -0.04972315995740759, 3.1330555770081077, -0.002105592116972321]


拍照获得数据比较快，根据拍照数据计算出位姿然后驱使UR动作这一步有点慢，后面可以改成第一拍照然后驱使UR夹爪角度转正，
第二次拍照完成后不用驱使夹爪纠偏计算好目标点位姿就好，之前第三部是完全纠偏之后拍照获取数据记录到log的，也可以去掉，这样整体速度会快不少


注意是在UR tool坐标系下面的偏移:
x:0.0833
y:-0.259
z:0.108

"""
